/*
	GoldKey

	F507DMT aka Левин Д.Ю. 
	BlackGoga aka Федотов В.В.

	http://goldkey-games.ru 
	https://vk.com/goldkey_dz
*/
serverTraders = ["RU_Soldier_Crew","RU_Soldier_AR","Herrera_Light","CZ_Soldier_MG_DES_EP1","RUS_Soldier_Sab","MVD_Soldier_TL","CZ_Special_Forces_TL_DES_EP1","RU_Secretary5","RU_Housewife3","RU_Damsel4","CIV_EuroWoman01_EP1","CZ_Soldier_Office_DES_EP1","Rita_Ensler_EP1","RU_Villager3","HouseWife1","Soldier_Sniper_KSVK_PMC","UN_CDF_Soldier_Pilot_EP1","TK_Commander_EP1","Ins_Lopotev","CIV_EuroWoman02_EP1","Soldier_GL_PMC","TK_CIV_Worker01_EP1","RU_Doctor","Dr_Annie_Baker_EP1","RU_Farmwife1","US_Soldier_AMG_EP1","UN_CDF_Soldier_Guard_EP1","Doctor","US_Soldier_SL_EP1","RUS_Commander","Assistant","RU_Commander","Dr_Hladik_EP1","US_Soldier_AAR_EP1","US_Soldier_EP1"];

// МАШИНЫ
menu_RU_Soldier_AR=[[
	["Копии ключей",714],
	["Б/У техника",302],
	["Мототехника",303],
	["Легковые",304],
	["Спорткары",305],
	["Пикапы",306],
	["Внедорожники",307],
	["Грузовики",308],
	["Армейский",309],
	["Origins",310],
	["Разное",311]
],[],"neutral"];
menu_Herrera_Light = menu_RU_Soldier_AR;

//АЭРОПОРТ
menu_UN_CDF_Soldier_Pilot_EP1=[[
	["Самолеты",361],
	["Вертолеты",362],
	["Тягач",363]
],[],"neutral"];

//ЛОДКИ
menu_RU_Villager3=[[
	["Плавсредства",371],
	["Origins",372]
],[],"neutral"];
menu_HouseWife1 = menu_RU_Villager3;

//ЧЕРНЫЙ РЫНОК
//ГЛАВНЫЙ 1
menu_TK_Commander_EP1=[[
	["Оружие",820],
	["Драгоценности",695],
	["Одежда бандитов",575],
	["Взрывчатка",529],
	["Б/У техника",302],
	["Легковые",321],
	["Грузовики",322],
	["Армейский",323]
],[],"black"];

//ПОМОШНИК 1
menu_Ins_Lopotev=[[
	["Оружие",526],
	["Патроны",527],
	["Пистолеты",710],
	["Пистол.Патроны",814],
	["Авто.Патроны",696],
	["Медицина",712],
	["Скины",112],
	["Разное",713]
],[],"black"];
menu_RU_Farmwife1 = menu_Ins_Lopotev;

//РЫНКИ ГЕРОЕВ
//Герой 1
menu_Soldier_GL_PMC=[[
	["Оружие",477],
	["Патроны",478],
	["Мульти.скины.Mod",116],
	["Мульти.скины.Arma",110]
],[],"hero"];

//Герой 1 техника
menu_RU_Soldier_Crew=[[
	["Б/У техника",302],
	["Внедорожники",331],
	["Хаммеры",332],
	["Бронетехника",333],
	["Вертолеты РУС",334],
	["Вертолеты НАТО",335],
	["Origins",336]
],[],"hero"];

//Герой 2
menu_Soldier_Sniper_KSVK_PMC=[[
	["Внедорожники",351],
	["Бронетехника",352],
	["Вертолеты",353],
	["Оружие",704],
	["Разное",706],
	["Мульти.скины.Mod",116],
	["Мульти.скины.Arma",110]
],[],"hero2"];


//ОРУЖИЕ
menu_RUS_Soldier_Sab=[[
	["Снайп.винтовки",810],["Ручн.пулеметы",812],["Пистолеты",808],["Автоматы HK",830],["Автоматы",811],["ACR",816],["АК",815],["ПП",809],["Разное",607]
],[],"neutral"];
menu_CZ_Soldier_MG_DES_EP1 = menu_RUS_Soldier_Sab;

//ПАТРОНЫ
menu_MVD_Soldier_TL=[[
	["Снайп.винтовки",819],["Пулемёт.патроны",817],["Пистолеты",814],["Автоматы",813],["ПП",818],["Разное",613]
],[],"neutral"];
menu_CZ_Special_Forces_TL_DES_EP1 = menu_MVD_Soldier_TL;

//СУМКИ ЕДА ВОДА
menu_RU_Secretary5=[[
	["Мульти.скины.Mod",116],["Мульти.скины.Arma",110],["Женские скины",115],["Обыч.скины",117],["Мясо",630],["Вода",601],["Консервы",629],["Сумки",632]
],[],"neutral"];
menu_RU_Housewife3 = menu_RU_Secretary5;
menu_RU_Damsel4 = menu_RU_Secretary5;

//СТРОЙКА СНАРЯЖЕНИЕ
menu_CIV_EuroWoman02_EP1=[[
	["Стройка",662],["Снаряжение",663],["Запчасти",664]
],[],"neutral"];
menu_CIV_EuroWoman01_EP1 = menu_CIV_EuroWoman02_EP1;
menu_Rita_Ensler_EP1 = menu_CIV_EuroWoman02_EP1;
menu_CZ_Soldier_Office_DES_EP1 = menu_CIV_EuroWoman02_EP1;

//ОПТОВИК
menu_Assistant=[[
	["Оптовик",555],["Стройка",707]
],[],"neutral"];
menu_TK_CIV_Worker01_EP1 = menu_Assistant;

//ДОКТОР
menu_RU_Doctor=[[
	["Пси-защита",821],["Медицина",670],["Книги",708],["Хим.свет",669],["Дымовые гранаты",671]
],[["FoodBioMeat","ItemZombieParts",1,1,"buy","Zombie Parts","Bio Meat",101]],"neutral"];
menu_Dr_Hladik_EP1=menu_RU_Doctor;
menu_Dr_Annie_Baker_EP1=menu_RU_Doctor;

//БАНК
menu_RUS_Commander=[[
	["Обмен металлов",100],["Драгоценности",101],["Руда",102]
],[],"neutral"];
menu_US_Soldier_SL_EP1 = menu_RUS_Commander;


//Унивирсальные торговцы
//===Оружие===
//40К
menu_US_Soldier_AMG_EP1=[[
	["Г2.Оружие",704],["=====================",999],
	["Г1.Оружие",477],["=====================",999],["Ч.Оружие",820],["Ч2.Оружие",526],["Ч.Пистолеты",710],["=====================",999],
	["Снайп.винтовки",810],["Ручн.пулеметы",812],["Пистолеты",808],["Автоматы HK",830],["Автоматы",811],["ACR",816],["АК",815],["ПП",809],["Разное",607]
],[],"neutral"];

//10К
menu_US_Soldier_AAR_EP1=[[
	["Г1.Оружие",477],["=====================",999],["Ч.Оружие",820],["Ч2.Оружие",526],["Ч.Пистолеты",710],["=====================",999],
	["Снайп.винтовки",810],["Ручн.пулеметы",812],["Пистолеты",808],["Автоматы HK",830],["Автоматы",811],["ACR",816],["АК",815],["ПП",809],["Разное",607]
],[],"neutral"];

//5К
menu_US_Soldier_EP1=[[
	["Ч.Оружие",820],["Ч2.Оружие",526],["Ч.Пистолеты",710],["=====================",999],
	["Снайп.винтовки",810],["Ручн.пулеметы",812],["Пистолеты",808],["Автоматы HK",830],["Автоматы",811],["ACR",816],["АК",815],["ПП",809],["Разное",607]
],[],"neutral"];

//===Разное===
menu_UN_CDF_Soldier_Guard_EP1=[[
	["Снайп.винтовки",819],["Пулемёт.патроны",817],["Пистолеты",814],["Автоматы",813],["ПП",818],["Разное",613],["=====================",999],
	["Мульти.скины.Mod",116],["Мульти.скины.Arma",110],["Женские скины",115],["Обыч.скины",117],["Сумки",632],["=====================",999],
	["Стройка",662],["Снаряжение",663],["Запчасти",664],["Оптовик",555],["Стройка",707],["=====================",999],
	["Обмен металлов",100],["Драгоценности",101],["Руда",102],["=====================",999],
	["Ч1.Одежда бандитов",575],["Ч1.Взрывчатка",529],["Ч1.Пистол.Патроны",814],["Ч1.Авто.Патроны",696],["Ч1.Патроны",527],["Ч1.Скины",112],["Ч1.Разное",713],["Г2.Разное",706],["=====================",999],
	["Г1.Мульти.скины.Mod",116],["Г1.Мульти.скины.Arma",110],["Г2.Разное",706]
],[],"neutral"];

//===Медицина===
menu_Doctor=[[
	["Пси-защита",821],["Медицина",670],["Книги",708],["Хим.свет",669],["Дымовые гранаты",671],["=====================",999],["Мясо",630],["Вода",601],["Консервы",629]
],[],"neutral"];

//===Машины===
menu_RU_Commander=[[
	["Г2.Внедорожники",351],["Г2.Бронетехника",352],["Г2.Вертолеты",353],["=====================",999],
	["Г1.Внедорожники",331],["Г1.Хаммеры",332],["Г1.Бронетехника",333],["Г1.Вертолеты РУС",334],["Г1.Вертолеты НАТО",335],["Origins",336],["=====================",999],
	["Ч.Легковые",321],["Ч.Грузовики",322],["Ч.Армейский",323],["=====================",999],
	["Копии ключей",714],["Б/У техника",302],["Мототехника",303],["Легковые",304],["Спорткары",305],["Пикапы",306],["Внедорожники",307],["Грузовики",308],["Армейский",309],["Origins",310],["Разное",311],["=====================",999],
	["Плавсредства",371],["Origins",372],["=====================",999],["Самолеты",361],["Вертолеты",362],["Тягач",363]	
],[],"neutral"];